[
  {
    "id": "oracle.resultSetter",
    "defaultMessage": "Result setter"
  },
  {
    "id": "oracle.consensus",
    "defaultMessage": "Consensus Threshold {value}. This value indicates the amount of BOT needed to set the result."
  },
  {
    "id": "topBar.betting",
    "defaultMessage": "Betting"
  },
  {
    "id": "cardInfo.bet",
    "defaultMessage": "Bet"
  },
  {
    "id": "topBar.setting",
    "defaultMessage": "Setting"
  },
  {
    "id": "oracle.resultSetNote",
    "defaultMessage": "BOT tokens are needed for result setting. Don't leave this screen upon clicking Confirm. Your BOT needs to be approved before result setting. The approved amount will automatically be used to set the result after approval."
  },
  {
    "id": "cardInfo.setResult",
    "defaultMessage": "Set Result"
  },
  {
    "id": "oracle.pass",
    "defaultMessage": "Current block time has passed the Result Setting End Time."
  },
  {
    "id": "oracle.notCen",
    "defaultMessage": "You are not the Centralized Oracle for this Topic and cannot set the result."
  },
  {
    "id": "oracle.openRes",
    "defaultMessage": "The Centralized Oracle has not set the result yet, but you may set the result by staking BOT."
  },
  {
    "id": "topBar.voting",
    "defaultMessage": "Voting"
  },
  {
    "id": "oracle.voting-1",
    "defaultMessage": "Consensus Threshold {value}. This value indicates the amount of BOT needed to reach the Proof of Agreement and become the new result."
  },
  {
    "id": "oracle.voteNote",
    "defaultMessage": "BOT tokens are needed for voting. Don't leave this screen upon clicking Confirm. Your BOT needs to be approved before voting. The approved amount will automatically be used to vote afterwards."
  },
  {
    "id": "cardInfo.vote",
    "defaultMessage": "Voting"
  },
  {
    "id": "cardInfo.finalize",
    "defaultMessage": "Finalize"
  },
  {
    "id": "oracle.passVote",
    "defaultMessage": "Current block time has passed the Voting End Time. The previous result needs to be finalized in order to withdraw."
  },
  {
    "id": "oracle.finalize",
    "defaultMessage": "Finalizing can be done by anyone. Once finalized, winners can withdraw from the event in the Withdraw tab."
  }
]